package com.example.searchNearby;

public class Constants {
    public static final int DATA_ERROR = 0;
    public static final int SERVERDATA_ERROR = 1;
    public  static  final int SUCCESS = -1;
    public static  final  String JSON_URL  = "https://api.weibo.com/2/location/pois/search/by_geo.json?access_token=2.00CNBWKEBthqxB20eacc078c2HH6BD";
    public static  final String KEY = "95d37ccd2d9733fc28f3383056188b01";
//    public static final String ACCESS_TOKEN = "access_token=2.00CNBWKEBthqxB20eacc078c2HH6BD";
    public static final String MAIN_ACTIVITY_LISTVIEW_SELECTED = "mainSelected";
    public static final String SECOND_ACTIVITY_LISTVIEW_SELECTED = "secondSelected";
    public static final String THRID_ACTIVITY_LISTVIEW_SELECTED = "thridSelected";
    public static final String TAG = "SearchNearby";
    public static final String[] FIRST_DATA = {"餐饮服务", "购物服务", "生活服务", "体育休闲服务", "医疗保健服务", "住宿服务", "科教文化服务", "交通设施服务", "公共设施"};
    public static final String[][] SECOND_DATA = {
            {"中餐厅", "外国餐厅", "快餐厅", "休闲餐饮场所", "咖啡厅", "茶艺馆", "冷饮店", "糕饼店", "甜品店"},
            {"商场", "便民商店/便利店", "家电电子卖场", "超级市场", "花鸟鱼虫市场", "家居建材市场", "综合市场", "文化用品店", "体育用品店", "特色商业街", "服装鞋帽皮具店", "专卖店", "特殊买卖场所", "个人用品/化妆品店"},
            {"旅行社", "信息咨询中心", "售票处", "邮局", "物流速递", "电讯营业厅", "事务所", "人才市场", "自来水营业厅", "电力营业厅", "美容美发店", "维修站点", "摄影冲印店", "洗浴推拿场所", "洗衣店", "中介机构", "搬家公司", "彩票彩券销售点", "丧葬设施"},
            {"运动场馆", "高尔夫相关", "娱乐场所", "度假疗养场所", "休闲场所", "影剧院"},
            {"综合医院", "专科医院", "诊所", "急救中心", "疾病预防机构", "医药保健相关", "动物医疗场所"},
            {"宾馆酒店", "旅馆招待所"},
            {"博物馆", "展览馆", "会展中心", "美术馆", "图书馆", "科技馆", "天文馆", "文化宫", "档案馆"},
            {"飞机场", "火车站", "港口码头", "长途汽车站", "地铁站", "轻轨站", "公交车站", "班车站", "停车场"},
            {"报刊亭", "公用电话", "公共厕所", "紧急避难场所"}

    };
    public static final String[][][] THRID_DATA = {{
            {"综合酒楼", "浙江菜", "四川菜（川菜）", "广东菜（粤菜）", "江苏菜", "浙江菜", "上海菜", "湖南菜（湘菜）", "安徽菜（徽菜）", "福建菜", "北京菜", "湖北菜（鄂菜）", "东北菜", "云贵菜", "西北菜", "老字号", "火锅店", "特色/地方风味餐厅", "海鲜酒楼", "中式素菜馆", "清真菜馆", "台湾菜", "潮州菜"},
            {"外国餐厅", "西餐厅（综合风味)", "日本料理", "韩国料理", "法式菜品餐厅", "意式菜品餐厅", "泰国／越南菜品餐厅", "地中海风格菜品", "美式风味", "印度风味", "英国式菜品餐厅", "牛扒店(扒房)", "俄国菜", "葡国菜", "德国菜", "巴西菜", "墨西哥菜", "其它亚洲菜"},
            {"快餐厅", "肯德基", "麦当劳", "必胜客", "永和豆浆", "茶餐厅", "大家乐", "大快活", "美心", "吉野家", "仙跡岩"},
            {null},
            {"咖啡厅", "星巴克咖啡", "上岛咖啡", "Pacific Coffee Company", "巴黎咖啡店"},
            {null},
            {null},
            {null},
            {null},
    },
            {
                    {"商场", "购物中心", "普通商场", "免税品店"},
                    {"便民商店／便利店", "7-ELEVEN便利店", "OK便利店"},
                    {"家电电子卖场", "综合家电商场", "国美", "大中", "苏宁", "手机销售", "数码电子", "丰泽", "镭射"},
                    {"超市", "家乐福", "沃尔玛", "华润", "北京华联", "上海华联", "麦德龙", "万客隆", "华堂易", "初莲花", "好又多", "屈臣氏", "乐购", "惠康超市", "百佳超市", "万宁超市"},
                    {"花鸟鱼虫市场", "花卉市场", "宠物市场"},
                    {"家居建材市场", "家具建材综合市场", "家具城", "建材五金市场", "厨卫市场", "布艺市场", "灯具瓷器市场"},
                    {"综合市场", "小商品市场", "旧货市场", "农副产品市场", "果品市场", "蔬菜市场", "水产海鲜市场"},
                    {null},
                    {"体育用品店", "李宁专卖店", "耐克专卖店", "阿迪达斯专卖店", "锐步专卖店", "彪马专卖店", "高尔夫用品店", "户外用品"},
                    {"特色商业街", "步行街"},
                    {"服装鞋帽皮具店", "品牌服装店", "品牌鞋店", "品牌皮具店"},
                    {"专营店", "古玩字画店", "珠宝首饰工艺品", "钟表店", "眼镜店", "书店", "音像店", "儿童用品店", "自行车专卖店", "礼品饰品店", "烟酒专卖店", "宠物用品店", "摄影器材店", "宝马生活方式"},
                    {"特殊买卖场所", "拍卖行", "典当行"},
                    {"其它个人用品店", "莎莎"}

            },
            {
                    {null},
                    {null},

                    {"售票处", "飞机票代售点", "火车票代售点", "长途汽车票代售点", "船票代售点", "公交卡／月票代售点", "公园景点售票处"},
                    {"邮局", "邮政速递"},
                    {null},
                    {"电讯营业厅", "中国电信营业厅", "中国网通营业厅", "中国移动营业厅", "中国联通营业厅", "中国铁通营业厅", "中国卫通营业厅", "和记电讯", "数码通电讯", "电讯盈科", "中国移动万众/Peoples"},
                    {"事务所", "律师事务所", "会计师事务所", "评估事务所", "审计事务所", "认证事务所", "专利事务所"},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {"彩票彩券销售点", "马会投注站"},
                    {"丧葬设施", "陵园", "公墓", "殡仪馆"}
            },
            {
                    {"运动场所", "综合体育馆", "保龄球馆", "网球场", "篮球场馆", "足球场", "滑雪场", "溜冰场", "户外健身场所", "海滨浴场", "游泳馆", "健身中心", "乒乓球馆", "台球厅", "壁球场", "马术俱乐部", "赛马场", "橄榄球场", "羽毛球场", "跆拳道场馆"},
                    {"高尔夫相关", "高尔夫球场", "高尔夫练习场"},
                    {"娱乐场所", "夜总会", "ＫＴＶ", "迪厅", "酒吧", "游戏厅", "棋牌室", "博采中心", "网吧"},
                    {"度假疗养场所", "度假村", "疗养院"},
                    {"休闲场所", "游乐场", "垂钓园", "采摘园", "露营地", "水上活动中心"},
                    {"影剧院相关", "电影院", "音乐厅", "剧场"}
            },
            {
                    {"综合医院", "三级甲等医院", "卫生院"},
                    {"专科医院", "整形美容", "口腔医院", "眼科医院", "耳鼻喉医院", "胸科医院", "骨科医院", "肿瘤医院", "脑科医院", "妇科医院", "精神病医院", "传染病医院"},
                    {null},
                    {null},
                    {null},
                    {"医药保健相关", "药房", "医疗保健用品"},
                    {"动物医疗场所", "宠物诊所", "兽医站"}
            },
            {
                    {"宾馆酒店", "六星级宾馆", "五星级宾馆", "四星级宾馆", "三星级宾馆", "经济型连锁酒店"},
                    {"旅馆招待所", "青年旅社"}
            },
            {
                    {"博物馆", "奥迪博物馆", "奔驰博物馆"},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
                    {null},
            },
            {
                    {null},
                    {null},
                    {"港口码头", "客运港", "车渡口", "人渡口"},
                    {null},
                    {null},
                    {null},
                    {"公交车站相关", "旅游专线车站", "普通公交站"},
                    {null},
                    {"停车场相关", "室内停车场", "室外停车场", "停车换乘点"},
                    {null},
            },
            {
                    {null},
                    {null},
                    {null},
                    {null},
            }
    };
}
